# 1.1 Series的创建

In [6]:
# 导入pandas 包
import pandas as pd
import numpy as np
pd.Series(data=None, index=None, dtype=None)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_6288\2745952692.py:4: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series(data=None, index=None, dtype=None)

Series([], dtype: float64)

In [7]:
pd.Series(np.arange(10))   #指定内容，默认索引

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [8]:
pd.Series([6.7,5.6,3,10,2], index=[1,2,3,4,5])   #index=[1,2,3,4,5]) 指定索引

1     6.7
2     5.6
3     3.0
4    10.0
5     2.0
dtype: float64

In [9]:
#通过字典数据创建
color_count = pd.Series({'red':100, 'blue':200, 'green': 500, 'yellow':1000})
color_count

red        100
blue       200
green      500
yellow    1000
dtype: int64

# 1.2 Series的属性

In [10]:
color_count.index

Index(['red', 'blue', 'green', 'yellow'], dtype='object')

In [11]:
color_count.values

array([ 100,  200,  500, 1000], dtype=int64)

In [12]:
color_count[2]  #也可以使用索引来获取数据：

500

# 2.1 DataFrame的创建

In [13]:
# 导入pandas包
import pandas as pd
pd.DataFrame(data=None, index=None, columns=None)
pd.DataFrame(np.random.randn(2,3))

          0         1         2
0 -0.142672 -1.329259  1.713550
1 -0.042570  1.275811  0.397528

In [14]:
#直接使用np创建的数组显示方式
# 生成10名同学，5门功课的数据
score = np.random.randint(40, 100, (10, 5))

In [15]:
score

array([[65, 50, 49, 55, 59],
       [76, 79, 71, 68, 47],
       [42, 60, 93, 88, 60],
       [69, 48, 70, 92, 97],
       [74, 94, 46, 79, 84],
       [80, 73, 50, 48, 74],
       [97, 52, 52, 69, 59],
       [46, 55, 96, 99, 62],
       [81, 81, 82, 89, 47],
       [75, 51, 93, 43, 94]])

In [16]:

# 使用Pandas中的数据结构
score_df = pd.DataFrame(score)

In [17]:
score_df

    0   1   2   3   4
0  65  50  49  55  59
1  76  79  71  68  47
2  42  60  93  88  60
3  69  48  70  92  97
4  74  94  46  79  84
5  80  73  50  48  74
6  97  52  52  69  59
7  46  55  96  99  62
8  81  81  82  89  47
9  75  51  93  43  94

In [18]:
#增加行、列索引

# 构造行索引序列
subjects = ["语文", "数学", "英语", "政治", "体育"]

# 构造列索引序列
stu = ['同学' + str(i) for i in range(score_df.shape[0])]

# 添加行索引
data = pd.DataFrame(score, columns=subjects, index=stu)

In [19]:
data

     语文  数学  英语  政治  体育
同学0  65  50  49  55  59
同学1  76  79  71  68  47
同学2  42  60  93  88  60
同学3  69  48  70  92  97
同学4  74  94  46  79  84
同学5  80  73  50  48  74
同学6  97  52  52  69  59
同学7  46  55  96  99  62
同学8  81  81  82  89  47
同学9  75  51  93  43  94

# 2.3.2 重设索引

In [20]:
# 重置索引,drop=False
data.reset_index()

  index  语文  数学  英语  政治  体育
0   同学0  65  50  49  55  59
1   同学1  76  79  71  68  47
2   同学2  42  60  93  88  60
3   同学3  69  48  70  92  97
4   同学4  74  94  46  79  84
5   同学5  80  73  50  48  74
6   同学6  97  52  52  69  59
7   同学7  46  55  96  99  62
8   同学8  81  81  82  89  47
9   同学9  75  51  93  43  94

In [21]:
# 重置索引,drop=True
data.reset_index(drop=True)

   语文  数学  英语  政治  体育
0  65  50  49  55  59
1  76  79  71  68  47
2  42  60  93  88  60
3  69  48  70  92  97
4  74  94  46  79  84
5  80  73  50  48  74
6  97  52  52  69  59
7  46  55  96  99  62
8  81  81  82  89  47
9  75  51  93  43  94

 # 2.3.3 以某列值设置为新的索引

In [23]:
#1、创建
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale':[55, 40, 84, 31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [24]:
#2、以月份设置新的索引
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [25]:
#3、设置多个索引，以年和月份
df = df.set_index(['year', 'month'])
df

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

# 3.1.1 multiIndex的特性

In [27]:
df.index
MultiIndex(levels=[[2012, 2013, 2014], [1, 4, 7, 10]],
           labels=[[0, 2, 1, 2], [0, 1, 2, 3]],
           names=['year', 'month'])

NameError: name 'MultiIndex' is not defined